ERP DEV.WMS/src/Documents/вмс_ПередачаНаХранение/вмс_ПередачаНаХранение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ПередачаНаХранение</name>
  <registerRecords>AccumulationRegister.вмс_ОстаткиТоваровПоклажедателя</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.вмс_СписокСтатусовДокументовПоклажедателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.вмс_Поклажедатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийФайл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВнешнегоФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеСопоставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДляЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДляЗаполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоклажедателя</name>
      <type>
        <types>CatalogRef.вмс_КарточкаПоклажедателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Documents/вмс_ПередачаНаХранение/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СохранитьВнешнийФайл(Команда)
	
	СохранитьФайл(Объект.ИмяВнешнегоФайла, СсылкаНаВнешнийФайл);	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлДляЗаполнения(Команда)

	СохранитьФайл(Объект.ИмяФайлаДляЗаполнения, СсылкаНаФайлДляЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(ИмяФайла, СсылкаНаФайл)
	
    Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Проводник.ПолноеИмяФайла = ИмяФайла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСохранение", ЭтотОбъект, СсылкаНаФайл);
	Проводник.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСохранение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Данные = ПолучитьИзВременногоХранилища(ДополнительныеПараметры);
		Данные.Записать(ВыбранныеФайлы[0]);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеВнешнегоФайла = ТекущийОбъект.ВнешнийФайл.Получить();
	СсылкаНаВнешнийФайл = ПоместитьВоВременноеХранилище(ДанныеВнешнегоФайла, УникальныйИдентификатор);     
    ДанныеФайлаДляЗаполнения = ТекущийОбъект.ФайлДляЗаполнения.Получить();
	СсылкаНаФайлДляЗаполнения = ПоместитьВоВременноеХранилище(ДанныеФайлаДляЗаполнения, УникальныйИдентификатор);

	Если НЕ вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Объект.Контрагент) Тогда
		Элементы.СписокНоменклатурыНоменклатураХарактеристика.Видимость = Ложь; 
		Элементы.СписокНоменклатурыХарактеристикаУчетнойСистемы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьНаОснованииНаСервере(ДокОснованиеСсылка)

//	//Объект.Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОжидаетПоставки;
//	Объект.Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.Новый;
//	
//	Попытка
//   		Записать();  
//		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
//	Исключение
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Не удалось создать документ. ";
//		Сообщение.Сообщить();
//		
//		Возврат;
//	КонецПопытки;   	
//	
//	НовыйДокумент = Ложь;
//	
//	НайденныйДокУчСис = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(ДокОснованиеСсылка); 
//	
//	Если НайденныйДокУчСис = Неопределено Тогда
//		Док = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
//		Док.Заполнить(Неопределено);    
//		
//		НовыйДокумент = Истина;
//	Иначе
//		Док = НайденныйДокУчСис.ПолучитьОбъект();  
//		
//		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденныйДокУчСис, "Проведен") Тогда
//			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения); 	
//		КонецЕсли;
//	КонецЕсли;  
//	
//	Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
//	Док.Контрагент = ДокОснованиеСсылка.Контрагент;
//	Док.Партнер = ДокОснованиеСсылка.Контрагент.Партнер;	
//	Док.Организация = Справочники.Организации.УправленческаяОрганизация;  //?
//	Док.Дата = ДокОснованиеСсылка.Дата;
//	Док.Склад = ДокОснованиеСсылка.Склад;
//	Док.Комментарий = СтрШаблон("Создан на основании документа передача на хранение: %1. %2", ДокОснованиеСсылка, ДокОснованиеСсылка.Комментарий); 
//	// ТУ_ХабароваВВ_20.05.25++
//	Док.Валюта = Константы.БазоваяВалютаПоУмолчанию.Получить();    //?
//	Док.ВалютаВзаиморасчетов = Константы.БазоваяВалютаПоУмолчанию.Получить();    //?  
//	Док.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;   //?
//	// ТУ_ХабароваВВ_20.05.25--	
//	Док.Товары.Очистить();
//	
//	Для каждого СтрокаТЧ Из ДокОснованиеСсылка.СписокНоменклатуры Цикл  
//		ДокТЧ = Док.Товары.Добавить();    
//		
//		ДокТЧ.Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "НоменклатураУчетнойСистемы");
//		ДокТЧ.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "УпаковкаУчетнойСистемы"); 
//		ДокТЧ.КоличествоУпаковок = Число(СтрокаТЧ.Количество);      
//		ДокТЧ.Количество = Число(СтрокаТЧ.Количество);    
//		ДокТЧ.Цена = 1;
//		ДокТЧ.Сумма = ДокТЧ.Количество * ДокТЧ.Цена; 
//		ДокТЧ.СуммаВзаиморасчетов = ДокТЧ.Сумма;
//		ДокТЧ.СуммаСНДС = ДокТЧ.Сумма; 
//		ДокТЧ.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;    
//		ДокТЧ.Склад = Док.Склад;                           
//		Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(ДокОснованиеСсылка.Контрагент) Тогда
//			Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "БезХарактеристики") Тогда
//            	ДокТЧ.Характеристика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "ХарактеристикаУчетнойСистемы");
//			КонецЕсли;  
//		КонецЕсли;  
////		ДокТЧ.НазначениеТовара = ДокОснованиеСсылка.Контрагент;	
//	КонецЦикла;       
//	
//	Попытка
//		Док.Записать(РежимЗаписиДокумента.Проведение);   
//		
//		Объект.Статус = Перечисления.вмс_СписокСтатусовДокументовПоклажедателей.ОжидаетПоставки; 
//		Записать();
//	Исключение
//		Док.Записать();  
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = СтрШаблон("Документ учетной системы записан, но не проведен. %1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//		Сообщение.Сообщить();   
//	КонецПопытки;
//	
//	Если НовыйДокумент Тогда
//		Запись = РегистрыСведений.вмс_СвязанныеДокументыПоклажедателя.СоздатьМенеджерЗаписи();
//		Запись.Заполнить(Неопределено);
//		Запись.ДокументПоклажедателя = ДокОснованиеСсылка;   
//		Запись.ДокументУчетнойСистемы = Док.Ссылка;
//		Запись.Записать(Истина);  
//	КонецЕсли;  
//	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)

	Если Объект.ПометкаУдаления Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя создать документ учетной системы на основании документа, помеченного на удаление.";
		Сообщение.Сообщить();   
		
		Возврат;
	КонецЕсли;    

	НайденныйДокУчСис = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(Объект.Ссылка);
	
	Если НайденныйДокУчСис <> Неопределено Тогда
	    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Документ уже был создан. Перезаписать документ?",РежимДиалогаВопрос.ДаНетОтмена,0);
	Иначе
		ПолноеСопоставление = ПроверитьСопоставлениеСУчетнойСистемой(Объект.Ссылка);
		
		Если ПолноеСопоставление Тогда
			СоздатьНаОснованииНаСервере(Объект.Ссылка);  
			
			ДокументУчетнойСистемы(Неопределено);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПолноеСопоставление = ПроверитьСопоставлениеСУчетнойСистемой(Объект.Ссылка);
		
		Если ПолноеСопоставление Тогда
			СоздатьНаОснованииНаСервере(Объект.Ссылка);  
			
			ДокументУчетнойСистемы(Неопределено);
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ПроверитьСопоставлениеСУчетнойСистемой(ДокСсылка)

	Проверка = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя КАК НоменклатураПоклажедателя,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя.Номенклатура КАК НоменклатураУчетнойСистемы,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя.Характеристика КАК ХарактеристикаУчетнойСистемы,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя.Упаковка КАК УпаковкаУчетнойСистемы,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя.ХарактеристикаПоклажедателя КАК ХарактеристикаПоклажедателя,
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.НоменклатураПоклажедателя.УпаковкаПоклажедателя КАК УпаковкаПоклажедателя
		|ИЗ
		|	Документ.вмс_ПередачаНаХранение.Товары КАК вмс_ПередачаНаХранениеСписокНоменклатуры
		|ГДЕ
		|	вмс_ПередачаНаХранениеСписокНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.НоменклатураУчетнойСистемы) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В строке %1 у номенклатуры ""%2"" не заполнено сопоставление с учетной системой.", Выборка.НомерСтроки, Выборка.НоменклатураПоклажедателя);
				Сообщение.Сообщить();
				
				Проверка = Ложь;
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Выборка.УпаковкаУчетнойСистемы) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("В строке %1 у единицы измерения ""%2"" не заполнено сопоставление с учетной системой.", Выборка.НомерСтроки, Выборка.УпаковкаПоклажедателя);
				Сообщение.Сообщить();
				
				Проверка = Ложь;
			КонецЕсли;
			
			Если вмс_ЛичныйКабинетПоклажедателяВызовСервер.ПроверкаИспользованияХарактеристикПоКонтрагенту(Объект.Контрагент) Тогда
				Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.НоменклатураПоклажедателя, "БезХарактеристики") Тогда
					Если НЕ ЗначениеЗаполнено(Выборка.ХарактеристикаУчетнойСистемы) Тогда
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = СтрШаблон("В строке %1 у характеристики ""%2"" номенклатуры ""%3"" не заполнено сопоставление с учетной системой.", Выборка.НомерСтроки, Выборка.ХарактеристикаПоклажедателя, Выборка.НоменклатураПоклажедателя);
						Сообщение.Сообщить();
						
						Проверка = Ложь;
					КонецЕсли;						
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат Проверка;
	
КонецФункции

&НаКлиенте
Процедура ДокументУчетнойСистемы(Команда)
	
	НайденныйДокУчСис = вмс_ЛичныйКабинетПоклажедателяВызовСервер.НайтиДокументУчетнойСистемы(Объект.Ссылка);
	
	Если НайденныйДокУчСис = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ не создан";
		Сообщение.Сообщить();

		Возврат;
	Иначе   
		Если НЕ ПроверкаПроведенияСозданногоДокументаУчСистемы(НайденныйДокУчСис) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ учетной системы не проведен";
			Сообщение.Сообщить();
		КонецЕсли;    
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьДокументУчетнойСистемы", ЭтотОбъект, НайденныйДокУчСис);
		ПоказатьВопрос(Оповещение, "Открыть документ учетной системы?",РежимДиалогаВопрос.ДаНетОтмена,0);
	КонецЕсли;
	
КонецПроцедуры      

Функция ПроверкаПроведенияСозданногоДокументаУчСистемы(НайденныйДок)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденныйДок, "Проведен");	
КонецФункции 

&НаКлиенте
Процедура ОткрытьДокументУчетнойСистемы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("Ключ", Параметры);
		ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.ФормаОбъекта", ПараметрыФормы);
	Иначе
    	Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ИмяВнешнегоФайла) Тогда
		Элементы.ГруппаВнешниеФайлы.Видимость = Истина;
	КонецЕсли;             
	
	Если ЗначениеЗаполнено(Объект.ИмяФайлаДляЗаполнения) Тогда
		Элементы.ГруппаФайлыДляЗаполнения.Видимость = Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.Статус.РежимВыбораИзСписка = Истина;
	Элементы.Статус.СписокВыбора.Очистить();
	
	СписокСтатусов = вмс_ЛичныйКабинетПоклажедателяВызовСервер.СписокСтатусовДокументовДляВыбора("ПередачаНаХранение");
	
	Для каждого значение Из СписокСтатусов Цикл
		Элементы.Статус.СписокВыбора.Добавить(Значение);	
	КонецЦикла; 

КонецПроцедуры
